cesar-case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name inlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( face5 );
    }

    {
        name outlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( face6 );
    }

    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( face0 face1 face2 face3 face4 face7 face8 face9 face10 );
    }

    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( face11 );
    }


);


// ************************************************************************* //
