cesar-case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              uniform 320.64128;
        value           $internalField;
/*        type            fixedValue;*/
/*        value           uniform 320.64128;*/
    }
    outlet
    {
        type            totalPressure;
        p0              uniform 100.2004;
        value           $internalField;
/*        type            fixedValue;*/
/*        value           uniform 100.2004;*/
    }
    wall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
    "procB.*"
    {
        type            processor;
        value           uniform 0;
    }
}


// ************************************************************************* //
